<script setup lang="ts">
const questions = [
  {
    title: "Что делать, если мне нужен функционал, которого пока нет?",
    content:
      "Если нужного функционала пока нет, можно поискать обходное решение или альтернативный инструмент. Иногда стоит реализовать временный вариант самостоятельно. Также можно оставить запрос разработчикам или поучаствовать в добавлении функции, если проект open source.",
  },
  {
    title: "Что делать, если мне нужен функционал, которого пока нет?",
    content:
      "Если нужного функционала пока нет, можно поискать обходное решение или альтернативный инструмент. Иногда стоит реализовать временный вариант самостоятельно. Также можно оставить запрос разработчикам или поучаствовать в добавлении функции, если проект open source.",
  },
  {
    title: "Что делать, если мне нужен функционал, которого пока нет?",
    content:
      "Если нужного функционала пока нет, можно поискать обходное решение или альтернативный инструмент. Иногда стоит реализовать временный вариант самостоятельно. Также можно оставить запрос разработчикам или поучаствовать в добавлении функции, если проект open source.",
  },
  {
    title: "Что делать, если мне нужен функционал, которого пока нет?",
    content:
      "Если нужного функционала пока нет, можно поискать обходное решение или альтернативный инструмент. Иногда стоит реализовать временный вариант самостоятельно. Также можно оставить запрос разработчикам или поучаствовать в добавлении функции, если проект open source.",
  },
  {
    title: "Что делать, если мне нужен функционал, которого пока нет?",
    content:
      "Если нужного функционала пока нет, можно поискать обходное решение или альтернативный инструмент. Иногда стоит реализовать временный вариант самостоятельно. Также можно оставить запрос разработчикам или поучаствовать в добавлении функции, если проект open source.",
  },
  {
    title: "Что делать, если мне нужен функционал, которого пока нет?",
    content:
      "Если нужного функционала пока нет, можно поискать обходное решение или альтернативный инструмент. Иногда стоит реализовать временный вариант самостоятельно. Также можно оставить запрос разработчикам или поучаствовать в добавлении функции, если проект open source.",
  },
];
</script>

<template>
  <div class="container flex mt-[200px] gap-[125px]">
    <div class="space-y-10 min-w-[421px]">
      <h3 class="font-unbounded text-[32px] font-medium">
        Остались вопросы? Отвечаем
      </h3>

      <div
        class="bg-secondary p-10 rounded-[24px] space-y-4 bg-[url('@/assets/images/telegram.png')] bg-no-repeat bg-[right_top]"
      >
        <div class="space-y-[12px]">
          <icon-telegram class="text-purple text-[64px]" />

          <h4 class="font-unbounded text-xl font-medium">Поддержка</h4>
        </div>

        <div class="border border-[#333333]"></div>

        <div class="space-y-[12px]">
          <p>Чтобы задать вопрос, переходите в наш Телеграм.</p>

          <p>
            Мы ответим на любые вопросы и поможем с настройкой и разработкой
            Mini App
          </p>
        </div>

        <ui-button>Написать нам в телеграм</ui-button>
      </div>
    </div>

    <div class="w-full">
      <ui-accordion type="single" collapsible>
        <ui-accordion-item
          v-for="(item, index) in questions"
          :key="`question-${index}`"
          :value="`question-${index}`"
        >
          <ui-accordion-trigger>{{ item.title }}</ui-accordion-trigger>

          <ui-accordion-content>{{ item.content }}</ui-accordion-content>
        </ui-accordion-item>
      </ui-accordion>
    </div>
  </div>
</template>
